docs/DIAGRAMA_ER.md
```mermaid
erDiagram
    USUARIO ||--o{ PEDIDO : "realiza"
    USUARIO ||--o{ CARRITO : "posee"
    CATEGORIA ||--o{ PRODUCTO : "clasifica"
    PRODUCTO ||--o{ DETALLE_PEDIDO : "aparece en"
    PEDIDO ||--o{ DETALLE_PEDIDO : "contiene"

    USUARIO {
        int id PK
        varchar username UK
        varchar email UK
        varchar password_hash
        enum rol "cliente|admin"
        varchar pais
        varchar moneda
    }

    CATEGORIA {
        int id PK
        varchar nombre UK
        tinyint activa
    }

    PRODUCTO {
        int id PK
        varchar nombre
        text descripcion
        int categoria_id FK
        decimal precio
        varchar imagen
        int cantidad
        int stock_minimo
        enum estado "activo|inactivo"
    }

    PEDIDO {
        int id PK
        int usuario_id FK
        varchar codigo UK
        decimal total
        enum estado "pendiente|procesando|enviado|entregado|cancelado"
    }

    DETALLE_PEDIDO {
        int id PK
        int pedido_id FK
        int producto_id FK
        varchar nombre_producto
        decimal precio
        int cantidad
    }

    CARRITO {
        int id PK
        int usuario_id FK
        int producto_id FK
        int cantidad
    }
```
